app/views/articles/_form.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
---
<%= form_with model: [ @user, @user.articles.find(params[:id]) ] do |form| %>