app/views/users/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---
<h2>Article</h2>
<% @user.articles.each do |article| %>