app/controllers/articles_controller.rb

	def show
		@user = User.find(params[:user_id])
		@article = @user.articles.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def create
		@user = User.find(params[:user_id])
		@article = @user.articles.new(article_params)

		if @article.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Article 2"], ["body", "this is an article"], ["user_id", 1], ["created_at", "2022-08-24 07:37:51.012362"], ["updated_at", "2022-08-24 07:37:51.012362"]]

	def edit
		@user = User.find(params[:user_id])
		@article = @user.articles.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]

	def update
		@user = User.find(params[:user_id])
		@article = @user.articles.find(params[:id])

		if @article.update(article_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 2], ["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "pppwpropwpw"], ["updated_at", "2022-08-24 07:55:45.835313"], ["id", 3]]

	def destroy
		@user = User.find(params[:user_id])
		@article = @user.articles.find(params[:id])
		puts "raedy to destroy"
		@article.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]