app/controllers/articles_controller.rb

	def load_user
		@user = User.where(:id => params[:user_id]).last
		user_not_found if !@user.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"

	def load_article
		@article = @user.articles.where(:id => params[:id]).last if @user
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 11]]